www/lrn/lisp/lisp-5.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3c3695c">План работ</a></li>
<li><a href="#org700f0f3">Глобальное окружение</a></li>
<li><a href="#org65570a0">Функции для тестирования</a></li>
<li><a href="#org63e4001">Структура замыкания</a></li>
<li><a href="#org8f8c1f4">MyApply</a>
<ul>
<li><a href="#org90af264">Работа с CONS-ячейками</a></li>
<li><a href="#org85fb718">NULL-предикат</a></li>
<li><a href="#orgab64f9e">Встроенные функции арифметики</a></li>
<li><a href="#org369870f">CLOSURE</a></li>
<li><a href="#org5e7882c">PRINT</a></li>
<li><a href="#orgf8e464e">LIST</a></li>
</ul>
</li>
<li><a href="#org19f79b1">MyEval</a>
<ul>
<li><a href="#org9486b57">Самовычисляемые формы</a></li>
<li><a href="#org8d69c06">Вычисление символов</a></li>
<li><a href="#org37fe224">Цитирование</a></li>
<li><a href="#org032bd8b">Условное выполнение IF</a></li>
<li><a href="#orgd37c9c9">COND</a></li>
<li><a href="#orge109d2d">PROGN</a></li>
<li><a href="#org325d374">AND</a></li>
<li><a href="#orgce08354">OR</a></li>
<li><a href="#orge36c228">LET</a></li>
<li><a href="#org85e9b81">LET*</a></li>
<li><a href="#orgc667541">DEFUN</a></li>
<li><a href="#orgfab0fdb">SETQ</a></li>
<li><a href="#orgebdc3c5">LAMBDA</a></li>
<li><a href="#org4e16623">BLOCK</a></li>
<li><a href="#orga9a31b9">RETURN-FROM</a></li>
<li><a href="#org9d1c687">CATCH</a></li>
<li><a href="#org37b11ef">THROW</a></li>
</ul>
</li>
<li><a href="#orgacb3d47">REPL</a></li>
<li><a href="#orgd2811b8">Итоги</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3c3695c" class="outline-2">
<h2 id="org3c3695c">План работ</h2>
<div class="outline-text-2" id="text-org3c3695c">
<p>
Цель этого этапа: преобразовать наш интерпретатор так, чтобы получить возможность
использовать <code>block</code> и <code>return-from</code>. Для этого мы заведем специальный вид окружения
<code>block-env</code>, который будем замыкать также, как мы замыкаем окружение <code>env</code>.
</p>

<p>
Аналогично, заведем специальное окружение <code>catch-env</code>, которое делает то же самое, но
не в лексической области видимости, а в динамической. Так мы получим возможность
использовать <code>trow</code> и <code>catch</code>.
</p>

<p>
Все эти дополнительные окружения мы будем протягивать через все функции нашего
интерпретатора.
</p>
</div>
</div>

<div id="outline-container-org700f0f3" class="outline-2">
<h2 id="org700f0f3">Глобальное окружение</h2>
<div class="outline-text-2" id="text-org700f0f3">
<div class="org-src-container">
<pre class="src src-lisp" id="orgc789862">(defun assoc-2 (key alist cont errcont) ;; NB!: inverted order of
                                        ;; continuations (for lookup)
  (cond ((null alist)              (funcall errcont key))
        ((equal key (caar alist))  (funcall cont    (cdar alist)))
        (t                         (assoc-2 key (cdr alist) cont errcont))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org101d915">(assert (equal "ok:123"
               (assoc-2 'alfa '((alfa . 123))
                        (lambda (x) (format nil "ok:~A" x))
                        (lambda (x) (format nil "err:~A" x)))))
(assert (equal "err:ALFA"
               (assoc-2 'alfa '((beta . 123))
                        (lambda (x) (format nil "ok:~A" x))
                        (lambda (x) (format nil "err:~A" x)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="orgb198c32">;; environment
(defparameter *glob-env* nil)
;; lookup
(defun lookup (symb env errcont cont)
  (assoc-2 symb env cont
           (lambda (key)
             (assoc-2 key *glob-env* cont
                      (lambda (key)
                        (funcall errcont
                                 (format
                                  nil
                                  "UNBOUD VARIABLE [~A] ~%LOCAL ENV: [~A] ~%GLOBAL ENV: [~A]"
                                  key env *glob-env*)))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org36be52b">;; test lookup
(assert (equal "ok:123" (lookup 'aaa '((aaa . 123))
                                (lambda (x) (format nil "err:~A" x))
                                (lambda (x) (format nil "ok:~A" x)))))
(assert (equal nil      (lookup 'aaa '((bbb . 123))
                                (lambda (x) (declare (ignore x)) nil)
                                (lambda (x) (format nil "ok:~A" x)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org65570a0" class="outline-2">
<h2 id="org65570a0">Функции для тестирования</h2>
<div class="outline-text-2" id="text-org65570a0">
<div class="org-src-container">
<pre class="src src-lisp" id="org28541ab">(defun ok (x)
  (format t "~%ok: ~A" x)
  x)
(defun err (x)
  (format t "~%err: ~A" x)
  x)
</pre>
</div>
</div>
</div>

<div id="outline-container-org63e4001" class="outline-2">
<h2 id="org63e4001">Структура замыкания</h2>
<div class="outline-text-2" id="text-org63e4001">
<p>
Добавляем <code>block-env</code>, чтобы иметь возможность лексически его замыкать.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org21f82bf">(defstruct closure
  body
  env
  block-env
  args)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f8c1f4" class="outline-2">
<h2 id="org8f8c1f4">MyApply</h2>
<div class="outline-text-2" id="text-org8f8c1f4">
<p>
Теперь <code>myapply</code> принимает еще и <code>catch-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org39520f1">(define-condition unknown-function (error)
  ((fn :initarg :fn  :reader fn))
  (:report
   (lambda (condition stream)
     (format stream "Error in MYAPPLY: unknown-function: ~A"
             (fn condition)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org9126ddf">&lt;&lt;evaddmul_5&gt;&gt;
&lt;&lt;evlis_5&gt;&gt;
(defun myapply (fn args catch-env errcont cont)
  (cond
    &lt;&lt;myapply_car_cdr_cons_5&gt;&gt;
    &lt;&lt;myapply_null_5&gt;&gt;
    &lt;&lt;myapply_ariph_5&gt;&gt;
    &lt;&lt;myapply_closure_5&gt;&gt;
    &lt;&lt;myapply_print_5&gt;&gt;
    &lt;&lt;myapply_list_5&gt;&gt;
    (t (error 'unknown-function :fn fn))))
</pre>
</div>

<p>
А набор тестов остался без изменений:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org3e54187">&lt;&lt;myapply_car_cdr_cons_5_test&gt;&gt;
&lt;&lt;myapply_null_5_test&gt;&gt;
&lt;&lt;evaddmul_5_test&gt;&gt;
&lt;&lt;myapply_ariph_5_test&gt;&gt;
&lt;&lt;myapply_closure_5_test&gt;&gt;
&lt;&lt;myapply_print_5_test&gt;&gt;
&lt;&lt;myapply_evlis_5_test&gt;&gt;
&lt;&lt;myapply_list_5_test&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-org90af264" class="outline-3">
<h3 id="org90af264">Работа с CONS-ячейками</h3>
<div class="outline-text-3" id="text-org90af264">
<p>
Функции, которые работают с cons-ячейками теперь вызывают продолжение <code>cont</code>, передавая
ему в качестве параметра результат своих вычислений.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgaacb93f">((equal fn 'car)             (funcall cont (caar args)))
((equal fn 'cdr)             (funcall cont (cdar args)))
((equal fn 'cons)            (funcall cont (cons (car args) (cadr args))))
</pre>
</div>

<p>
Тесты такие-же, но теперь принимают продолжения
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgc744aa6">;; Тесты cons, car, cdr
(assert (equal '(1 . 2) (myeval '(cons 1 2) nil nil nil #'err #'ok)))
(assert (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil nil nil #'err #'ok)))
(assert (equal 2 (myeval '(car (cons 2 3)) nil nil nil #'err #'ok)))
(assert (equal 3 (myeval '(cdr (cons 2 3)) nil nil nil #'err #'ok)))
(assert (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil nil nil #'err #'ok)))
(assert (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil nil nil #'err #'ok)))
;; Тесты для cons-ячеек, вычисляемых в окружении
(assert (equal 1 (myeval '(car a) '((a . (1 . 2))) nil nil #'err #'ok)))
(assert (equal 2 (myeval '(cdr a) '((a . (1 . 2))) nil nil #'err #'ok)))
(assert (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))) nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
