www/lrn/lisp/lisp-5.html

<div id="outline-container-orgd37c9c9" class="outline-3">
<h3 id="orgd37c9c9">COND</h3>
<div class="outline-text-3" id="text-orgd37c9c9">
<p>
Пробрасываем <code>block-env</code> и <code>catch-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org35a3a2b">(defun evcond (exp env block-env catch-env errcont cont)
  (cond ((null exp)  (funcall cont nil))
        (t           (myeval (caar exp) env block-env catch-env errcont
                             (lambda (x)
                               (if x
                                   (myeval (cadar exp)
                                           env block-env catch-env
                                           errcont cont)
                                   (evcond (cdr exp)
                                           env block-env catch-env
                                           errcont cont)))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="orgcbca137">;; Тесты для EVCOND
(assert (equal 2   (evcond '((t 2)   (t 1)) nil nil nil #'err #'ok)))
(assert (equal 1   (evcond '((nil 2) (t 1)) nil nil nil #'err #'ok)))
(assert (equal nil (evcond '((nil 2) (nil 1)) nil nil nil #'err #'ok)))
;; Тесты для EVCOND, где участвует окружение
(assert (equal 2 (evcond '((a 2) (b 1))
                         '((a . 1) (b . ()))
                         nil nil #'err #'ok)))
(assert (equal 1 (evcond '((a 2) (b 1))
                         '((a . nil) (b . T))
                         nil nil #'err #'ok)))
</pre>
</div>

<p>
и адаптируем вызов внутри <code>myeval</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgdd7f69b">((equal (car exp) 'cond)     (evcond (cdr exp)
                                     env block-env catch-env
                                     errcont cont))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="orga0b38c5">;; Тесты для COND
(assert (equal 2 (myeval '(cond
                           (() 1)
                           (1 2))
                         nil nil nil #'err #'ok)))
(assert (equal 2 (myeval '(cond
                           (a 1)
                           (b 2))
                         '((a . ()) (b . 1))
                         nil nil #'err #'ok)))
(assert (equal 1 (myeval '(cond
                           (a 1)
                           (b 2))
                         '((a . 1) (b . ()))
                         nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge109d2d" class="outline-3">
<h3 id="orge109d2d">PROGN</h3>
<div class="outline-text-3" id="text-orge109d2d">
<p>
Пробрасываем <code>block-env</code> и <code>catch-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgd4ee174">(defun evprogn (lst env block-env catch-env errcont cont)
  (cond ((null lst)         (funcall cont nil))
        ((null (cdr lst))   (myeval (car lst) env block-env catch-env errcont cont))
        (t                  (myeval (car lst) env block-env catch-env errcont
                                    (lambda (x)
                                      (evprogn (cdr lst)
                                               env block-env catch-env
                                               errcont cont))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org1d5602f">;; Тест для EVPROGN
(assert (equal 2 (evprogn '(1 2) nil nil nil  #'err #'ok)))
;; Тест для EVPROGN в окружении
(assert (equal 3 (evprogn '(a b c)
                          '((a . 1) (b . 2) (c . 3))
                           nil nil #'err #'ok)))
</pre>
</div>

<p>
модифицируем вызов в <code>myeval</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org3ac05a8">((equal (car exp) 'progn)    (evprogn (cdr exp)
                                      env block-env catch-env
                                      errcont cont))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org8b8fe61">;; Тест для PROGN
(assert (equal 3 (myeval '(progn 1 2 3) nil nil nil #'err #'ok)))
;; Тест для PROGN в окружении
(assert (equal 3 (myeval '(progn a b c) '((a . 1) (b . 2) (c . 3))
                         nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
