www/lrn/lisp/lisp-5.html

<div id="outline-container-org325d374" class="outline-3">
<h3 id="org325d374">AND</h3>
<div class="outline-text-3" id="text-org325d374">
<p>
Пробрасываем <code>block-env</code> и <code>catch-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org3f38691">(defun evand (args env block-env catch-env errcont cont)
  (cond ((null args)        (funcall cont T))
        ((null (cdr args))  (myeval (car args) env block-env catch-env errcont cont))
        (t                  (myeval (car args) env block-env catch-env errcont
                                    (lambda (x)
                                      (if (null x)
                                          (funcall cont nil)
                                          (evand (cdr args) env block-env catch-env
                                                 errcont cont)))))))
</pre>
</div>

<p>
Поправим тесты
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgf39a580">;; Тесты для EVAND
(assert (equal (and)           (evand '() nil nil nil #'err #'ok)))
(assert (equal (and 1)         (evand '(1) nil nil nil #'err #'ok)))
(assert (equal (and nil)       (evand '(nil) nil nil nil  #'err #'ok)))
(assert (equal (and 1 nil)     (evand '(1 nil) nil nil nil #'err #'ok)))
(assert (equal (and 1 2 nil)   (evand '(1 2 nil) nil nil nil #'err #'ok)))
(assert (equal (and 1 2 3)     (evand '(1 2 3) nil nil nil #'err #'ok)))
(assert (equal (and 1 2 nil 3) (evand '(1 2 nil 3) nil nil nil #'err #'ok)))
;; Тесты для EVAND в окружении
(assert (equal (let ((a nil))
                 (and nil))
               (evand '(a) '((a . nil)) nil nil #'err #'ok)))
(assert (equal (let ((a 1))
                 (and a))
               (evand '(a) '((a . 1)) nil nil #'err #'ok)))
(assert (equal (let ((a 1)
                     (b nil))
                 (and a b))
               (evand '(a b) '((a . 1) (b . nil)) nil nil #'err #'ok)))
(assert (equal (let ((a 1)
                     (b 2)
                     (c nil))
                 (and a b c))
               (evand '(a b c) '((a . 1) (b . 2) (c . nil)) nil nil #'err #'ok)))
(assert (equal (let ((a 1)
                     (b 2)
                     (c 3))
                 (and a b c))
               (evand '(a b c) '((a . 1) (b . 2) (c . 3)) nil nil #'err #'ok)))
(assert (equal (let ((a 1)
                     (b 2)
                     (c nil)
                     (d 3))
                 (and a b c d))
               (evand '(a b c) '((a . 1) (b . 2) (c . nil) (d . 3)) nil nil #'err #'ok)))
</pre>
</div>

<p>
Добавим параметры в вызов
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orga157960">((equal (car exp) 'and)      (evand (cdr exp)
                                    env block-env catch-env
                                    errcont cont))
</pre>
</div>

<p>
Поправим тесты
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org55879b5">;; Тесты для AND
(assert (equal (and)                  (myeval '(and) nil nil nil #'err #'ok)))
(assert (equal (and 1)                (myeval '(and 1) nil nil nil #'err #'ok)))
(assert (equal (and nil)              (myeval '(and nil) nil nil nil #'err #'ok)))
(assert (equal (and 1 nil)            (myeval '(and 1 nil) nil nil nil #'err #'ok)))
(assert (equal (and 1 2 nil)          (myeval '(and 1 2 nil) nil nil nil #'err #'ok)))
(assert (equal (and 1 2 3)            (myeval '(and 1 2 3) nil nil nil #'err #'ok)))
(assert (equal (and 1 (and 1 2) 3  )  (myeval '(and 1 (and 1 2) 3) nil nil nil #'err #'ok)))
(assert (equal (and 1 (and 1 nil) 3)  (myeval '(and 1 (and 1 nil) 3) nil nil nil #'err #'ok)))
;; Тесты для AND в окружении
(assert (equal (let ((a nil))
                 (and nil))
               (myeval '(and a) '((a . nil)) nil nil #'err #'ok)))
(assert (equal (let ((a 1))
                 (and a))
               (myeval '(and a) '((a . 1)) nil nil #'err #'ok)))
(assert (equal (let ((a 1)
                     (b nil))
                 (and a b))
               (myeval '(and a b) '((a . 1) (b . nil)) nil nil #'err #'ok)))
(assert (equal (let ((a 1)
                     (b 2)
                     (c nil))
                 (and a b c))
               (myeval '(and a b c) '((a . 1) (b . 2) (c . nil)) nil nil #'err #'ok)))
(assert (equal (let ((a 1)
                     (b 2)
                     (c 3))
                 (and a b c))
               (myeval '(and a b c) '((a . 1) (b . 2) (c . 3)) nil nil #'err #'ok)))
(assert (equal (let ((a 1)
                     (b 2)
                     (c nil)
                     (d 3))
                 (and a b c d))
               (myeval '(and a b c) '((a . 1) (b . 2) (c . nil) (d . 3)) nil nil #'err #'ok)))
(assert (equal (let ((a 1)
                     (b 2)
                     (c 3))
                 (and a (and a b) c))
               (myeval '(and a (and a b) c) '((a . 1) (b . 2) (c . 3)) nil nil #'err #'ok)))
(assert (equal (let ((a 1)
                     (b nil)
                     (c 3))
                 (and a (and a b) c))
               (myeval '(and a (and a b) c) '((a . 1) (b . nil) (c . 3)) nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
