www/lrn/lisp/lisp-5.html

<div id="outline-container-orgce08354" class="outline-3">
<h3 id="orgce08354">OR</h3>
<div class="outline-text-3" id="text-orgce08354">
<div class="org-src-container">
<pre class="src src-lisp" id="orgb46ff36">(defun evor (args env block-env catch-env errcont cont)
  (cond ((null args)        (funcall cont nil))
        ((null (cdr args))  (myeval (car args) env block-env catch-env errcont cont))
        (t                  (myeval (car args) env block-env catch-env errcont
                                    (lambda (x)
                                      (if (not (null x))
                                          (funcall cont x)
                                          (evor (cdr args) env block-env catch-env
                                                errcont cont)))))))
</pre>
</div>

<p>
Поправим тесты
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgcb8658b">;; Тесты для EVOR
(assert (equal (or)                   (evor '() nil nil nil #'err #'ok)))
(assert (equal (or nil 1)             (evor '(nil 1) nil nil nil #'err #'ok)))
(assert (equal (or nil nil 1)         (evor '(nil nil 1) nil nil nil #'err #'ok)))
(assert (equal (or nil 1 2)           (evor '(nil 1 2) nil nil nil #'err #'ok)))
(assert (equal (or 1 2 3)             (evor '(1 2 3) nil nil nil #'err #'ok)))
(assert (equal (or nil nil 3 nil)     (evor '(nil nil 3 nil) nil nil nil #'err #'ok)))
;; Тесты для EVOR в окружении
(assert (equal (let ((a nil))
                 (or a))
               (evor '(a) '((a . nil)) nil nil #'err #'ok)))
(assert (equal (let ((a 1))
                 (or a))
               (evor '(a) '((a . 1)) nil nil #'err #'ok)))
(assert (equal (let ((a nil)
                     (b 1))
                 (or a b))
               (evor '(a b) '((a . nil) (b . 1)) nil nil #'err #'ok)))
(assert (equal (let ((a nil)
                     (b nil)
                     (c 3))
                 (or a b c))
               (evor '(a b c) '((a . nil) (b . nil) (c . 3)) nil nil #'err #'ok)))
(assert (equal (let ((a nil)
                     (b 1)
                     (c 2))
                 (or a b c))
               (evor '(a b c) '((a . nil) (b . 1) (c . 2)) nil nil #'err #'ok)))
(assert (equal (let ((a nil)
                     (b nil)
                     (c 3)
                     (d nil))
                 (or a b c d))
               (evor '(a b c d) '((a . nil) (b . nil) (c . 3) (d . nil)) nil nil  #'err #'ok)))
</pre>
</div>

<p>
Добавим параметры в вызов
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org592dec7">((equal (car exp) 'or)       (evor  (cdr exp)
                                    env block-env catch-env
                                    errcont cont))
</pre>
</div>

<p>
Поправим тесты
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org3d7ce4f">;; Тесты для OR
(assert (equal (or)                  (myeval '(or) nil nil nil #'err #'ok)))
(assert (equal (or nil 1)            (myeval '(or nil 1) nil nil nil #'err #'ok)))
(assert (equal (or nil nil 1)        (myeval '(or nil nil 1) nil nil nil #'err #'ok)))
(assert (equal (or nil 1 2)          (myeval '(or nil 1 2) nil nil nil #'err #'ok)))
(assert (equal (or nil (or 3 2) 2)   (myeval '(or nil (or 3 2) 2) nil nil nil #'err #'ok)))
;; Тесты для OR в окружении
(assert (equal (let ((a nil))
                 (or a))
               (myeval '(or a) '((a . nil)) nil nil #'err #'ok)))
(assert (equal (let ((a 1))
                 (or a))
               (myeval '(or a) '((a . 1)) nil nil #'err #'ok)))
(assert (equal (let ((a nil)
                     (b 1))
                 (or a b))
               (myeval '(or a b) '((a . nil) (b . 1)) nil nil #'err #'ok)))
(assert (equal (let ((a nil)
                     (b nil)
                     (c 3))
                 (or a b c))
               (myeval '(or a b c) '((a . nil) (b . nil) (c . 3)) nil nil #'err #'ok)))
(assert (equal (let ((a nil)
                     (b 1)
                     (c 2))
                 (or a b c))
               (myeval '(or a b c) '((a . nil) (b . 1) (c . 2)) nil nil #'err #'ok)))
(assert (equal (let ((a nil)
                     (b nil)
                     (c nil)
                     (d 2))
                 (or a (or b c) d))
               (myeval '(or  a (or b c) d) '((a . nil) (b . nil) (c . nil) (d . 2))
                       nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge36c228" class="outline-3">
<h3 id="orge36c228">LET</h3>
<div class="outline-text-3" id="text-orge36c228">
<div class="org-src-container">
<pre class="src src-lisp" id="orgd120f03">(define-condition mypairlis-error (error)
  ((lst1 :initarg :lst1  :reader lst1)
   (lst2 :initarg :lst2  :reader lst2))
  (:report
   (lambda (condition stream)
     (format stream "Error in MYPAIRLIS: wrong params:~%'~A~%'~A"
             (lst1 condition) (lst2 condition)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org0356a1a">(defun mypairlis (lst1 lst2 alist)
  (cond ((and (null lst1) (null lst2))  alist)
        ((or  (null lst1) (null lst2))  (error 'mypairlis-error :lst1 lst1 :lst2 lst2))
        (t                              (cons (cons (car lst1)
                                                    (car lst2))
                                              (mypairlis (cdr lst1)
                                                         (cdr lst2)
                                                         alist)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org5895248">;; Тесты для MYPAIRLIS
(assert (equal '(( a . 1) (b . 2) ( c . 3) (z . 6) (y . 77))
               (mypairlis '(a b c) '(1 2 3) '((z . 6) (y . 77)))))
(assert (equal "error"
               (handler-case (mypairlis '(a b c) nil '((z . 6) (y . 77)))
                 (MYPAIRLIS-ERROR (condition) "error"))))
(assert (equal "error"
               (handler-case (mypairlis nil '(1 2 3) '((z . 6) (y . 77)))
                 (MYPAIRLIS-ERROR (condition) "error"))))
</pre>
</div>

<p>
Теперь нам понадобится новая функция <code>evlet</code>. Она рекурсивно вычисляет <code>exps</code>
перебрасывая вычисленные результаты в <code>evald-exps</code> и по окончании этого процесса
вызывает <code>evprogn</code> чтобы вычислить тело <code>let</code> в объединенном окружении.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org0eaf418">(defun evlet (vars exps evald-exps exp env block-env catch-env errcont cont)
  (cond ((null exps)  (evprogn exp
                               (pairlis vars (reverse evald-exps) env)
                               block-env catch-env
                               errcont cont))
        (t            (myeval (car exps) env block-env catch-env errcont
                              (lambda (x)
                                (evlet vars (cdr exps) (cons x evald-exps) exp
                                       env block-env catch-env
                                       errcont cont))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="orgab16d1d">;; Тесты для EVLET
(assert (equal 3 (evlet '(a b) '(1 2) nil '(4 (+ a b)) nil nil nil #'err #'ok)))
</pre>
</div>


<p>
используем <code>evlet</code> в <code>myeval</code> чтобы вычислить <code>let</code>
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org821cccd">((equal (car exp) 'let)      (evlet (mapcar #'car (cadr exp))
                                    (mapcar #'cadr (cadr exp))
                                    nil
                                    (cddr exp)
                                    env block-env catch-env
                                    errcont cont))
</pre>
</div>

<p>
Протестируем <code>let</code> и <code>evlet</code>
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org7fb9d77">;; Тесты для LET
(assert (equal '(1 . 2) (myeval '(let ((a 1)
                                       (b 2))
                                  (cons a b))
                                  nil nil nil
                                  #'err #'ok)))
</pre>
</div>
</div>
</div>
