www/lrn/lisp/lisp-5.html

<div id="outline-container-org85e9b81" class="outline-3">
<h3 id="org85e9b81">LET*</h3>
<div class="outline-text-3" id="text-org85e9b81">
<p>
Пробрасываем <code>block-env</code> и <code>catch-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org085eb57">(defun evletstar (varpairs exp env block-env catch-env errcont cont)
  (cond ((null varpairs)  (evprogn exp env block-env catch-env errcont cont))
        (t                (myeval (cadar varpairs) env block-env catch-env errcont
                                  (lambda (x)
                                    (evletstar (cdr varpairs) exp
                                               (acons (caar varpairs) x env)
                                               block-env catch-env
                                               errcont cont))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org16fce69">;; Тесты для EVLETSTAR
(assert (equal 2 (evletstar '((a 1) (b a)) '(4 (+ a b)) nil nil nil #'err #'ok)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org450a89f">((equal (car exp) 'let*)     (evletstar (cadr exp)
                                        (cddr exp)
                                        env block-env catch-env
                                        errcont cont))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org5bc5f6f">;; Тесты для LET*
(assert (equal '(3 1 . 2) (myeval '(let* ((a 1)
                                          (b 2)
                                          (c (+ a b)))
                                    (cons c (cons a b)))
                                  nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc667541" class="outline-3">
<h3 id="orgc667541">DEFUN</h3>
<div class="outline-text-3" id="text-orgc667541">
<p>
При создании функции мы добавляем в замыкание <code>block-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgaf37a1e">((equal (car exp) 'defun)         (progn
                                    (push (cons (cadr exp)
                                                (make-closure :body (cdddr exp)
                                                              :env env
                                                              :block-env block-env
                                                              :args (caddr exp)))
                                          *glob-env*)
                                    (funcall cont (cadr exp))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org9d460f7">;; Тесты для DEFUN
(assert (equal 64 (progn
                    (setf *glob-env* nil)
                    (myeval '(defun alfa (x) (* x x)) nil nil nil #'err #'ok)
                    (prog1 (myeval '(alfa 8) nil nil nil #'err #'ok)
                      (setf *glob-env* nil)))))
;; Тесты на IMPLICIT-PROGN в DEFUN
(assert (equal 384 (progn
                     (setf *glob-env* nil)
                     (myeval '(let ((y 3))
                               (defun alfa (x)
                                 (setq y 6)
                                 (* x x y)))
                             nil nil nil #'err #'ok)
                     (prog1 (myeval '(alfa 8) nil nil nil #'err #'ok)
                       (setf *glob-env* nil)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfab0fdb" class="outline-3">
<h3 id="orgfab0fdb">SETQ</h3>
<div class="outline-text-3" id="text-orgfab0fdb">
<p>
Пробрасываем <code>block-env</code> и <code>catch-env</code> и убираем комментарии:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org7937133">((equal (car exp) 'setq)     (myeval (caddr exp) env block-env catch-env errcont
                                     (lambda (val)
                                       (if (null (assoc (cadr exp) env))
                                           (if (null (assoc (cadr exp) *glob-env*))
                                               (push (cons (cadr exp) val)
                                                     *glob-env*)
                                               (rplacd (assoc (cadr exp) *glob-env*) val))
                                           (rplacd (assoc (cadr exp) env) val))
                                       (funcall cont val))))

</pre>
</div>

<p>
Добавляем к тестам дополнительные параметры
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org68db1be">;; Тесты для SETQ
;; Проверка изменения значения локальной переменной, не затрагивая глобального окружения
(assert (equal '((2 . 2) ((alfa . 0)))
               (progn
                 (setf *glob-env* '((alfa . 0)))
                 (prog1 (list (myeval '(cons (setq alfa 2)
                                        alfa)
                                      '((alfa . 1))
                                      nil nil #'err #'ok)
                              *glob-env*)
                   (setf *glob-env* nil)))))
;; Изменение значения несуществующей переменной (создание глобальной переменной)
(assert (equal '((1 . 1) ((ALFA . 1) (BETA . 222)))
               (progn
                 (setf *glob-env* '((beta . 222)))
                 (prog1 (list (myeval '(cons
                                        (setq alfa 1)
                                        alfa)
                                      nil nil nil #'err #'ok)
                              *glob-env*)
                   (setf *glob-env* nil)))))
;; Изменение значения существующей глобальной переменной
(assert (equal '((1 . 1) ((BETA . 1)))
               (progn
                 (setf *glob-env* '((beta . 222)))
                 (prog1 (list (myeval '(cons
                                        (setq beta 1)
                                        beta)
                                      nil nil nil #'err #'ok)
                              *glob-env*)
                   (setf *glob-env* nil)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebdc3c5" class="outline-3">
<h3 id="orgebdc3c5">LAMBDA</h3>
<div class="outline-text-3" id="text-orgebdc3c5">
<p>
При создании лямбды мы добавляем в замыкание <code>block-env</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgb381161">((equal (car exp) 'lambda)   (funcall cont (make-closure :body (cddr exp)
                                                         :env env
                                                         :block-env block-env
                                                         :args (cadr exp))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org0d63231">;; Тесты для LAMBDA
(assert (equal 3 (myeval '((lambda (x) (+ 1  x)) 2)
                         nil nil nil #'err #'ok)))
;; Тесты для LAMBDA в окружении
(assert (equal 5 (myeval '(let ((y 3))
                           ((lambda (x) (+ y x)) 2))
                         nil nil nil #'err #'ok)))
;; Тесты на IMPLICIT-PROGN в LAMBDA
(assert (equal 8 (myeval '(let ((y 3))
                           ((lambda (x)
                              (setq y 6)
                              (+ y x)) 2))
                         nil nil nil  #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e16623" class="outline-3">
<h3 id="org4e16623">BLOCK</h3>
<div class="outline-text-3" id="text-org4e16623">
<p>
При создании блока мы добавляем в окружение <code>block-env</code> пару вида
"(имя блока . продолжение)".
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org22255a8">((equal (car exp) 'block)    (myeval (caddr exp)
                                     env
                                     (acons (cadr exp)
                                            cont
                                            block-env)
                                     catch-env errcont cont))
</pre>
</div>

<p>
Тесты для BLOCK
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org89071b5">;; Тесты для BLOCK
(assert (equal nil (myeval '(block testblock)
                           nil nil nil #'err #'ok)))
(assert (equal 3 (myeval '(block testblock 3)
                         nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
