org/lrn/lisp/lisp-5.org
** RETURN-FROM

При выходе из блока мы извлекаем из окружения ~block-env~ соответствующее продолжение и
вызываем его.

#+NAME: myeval_return_from_5
#+BEGIN_SRC lisp
  ((equal (car exp)
          'return-from)        (if (not (symbolp (cadr exp)))
                                   (funcall errcont
                                            (format nil
                                                    "return-from: first argument not a symbol"))
                                   (myeval (caddr exp) env block-env catch-env errcont
                                           (lambda (x)
                                             (assoc-2 (cadr exp) block-env
                                                      (lambda (y) (funcall y x))
                                                      (lambda (y) (funcall errcont
                                                                           (format nil "return-from: undefined return block ~A" y))))))))
#+END_SRC

Тесты для RETURN-FROM

#+NAME: myeval_return_from_5_test
#+BEGIN_SRC lisp
  ;; Тесты для RETURN-FROM
  (assert (equal 3 (myeval '(block testblock (return-from testblock (+ 1 2)) 777)
                           nil nil nil #'err #'ok)))
  (assert (equal "error" (myeval '(block testblock (return-from notblock (+ 1 2)) 777)
                                 nil nil nil #'(lambda (x) "error") #'ok)))
  (assert (equal "error" (myeval '(progn (return-from not-found-block (+ 1 2)) 777)
                                 nil nil nil (lambda (x) "error")
                                 #'ok)))
  ;; Тест RETURN-FROM в лексической области видимости
  (assert (equal 12 (myeval '(progn
                              (defun foo (x)
                                (block in-lambda-block
                                  (return-from in-lambda-block
                                    (+ x 2))
                                  777))
                              (foo 10))
                            nil nil nil (lambda (x) "error")
                            #'ok)))
  ;; Тест RETURN-FROM в динамической области видимости (должна быть ошибка)
  (assert (equal "error" (myeval '(progn
                                   (defun foo (x)
                                     (return-from in-lambda-block
                                       (+ x 2))
                                     777)
                                   (block in-lambda-block
                                     (foo 10)))
                                 nil nil nil (lambda (x) "error")
                                 #'ok)))
#+END_SRC

** CATCH

При создании блока обработки исключений мы добавляем в окружение ~catch-env~ пару вида
"(имя блока . продолжение)".

#+NAME: myeval_catch_5
#+BEGIN_SRC lisp
  ((equal (car exp) 'catch)    (myeval (cadr exp) env block-env catch-env errcont
                                       (lambda (symb-res)
                                         (if (not (symbolp symb-res))
                                             (funcall errcont
                                                      (format nil "catch: first argument not a symbol"))
                                             (myeval (caddr exp)
                                                     env
                                                     block-env
                                                     (acons symb-res
                                                            cont
                                                            catch-env)
                                                     errcont cont)))))
#+END_SRC

Тесты для CATCH

#+NAME: myeval_catch_5_test
#+BEGIN_SRC lisp
  ;; Тесты для CATCH
  (assert (equal nil (myeval '(catch 'zzz)
                             nil nil nil #'err #'ok)))
  (assert (equal 3 (myeval '(catch 'zzz 3)
                           nil nil nil #'err #'ok)))

#+END_SRC

** THROW

Когда мы бросаем исключение, мы извлекаем из окружения ~catch-env~ соответствующее
продолжение и вызываем его.

#+NAME: myeval_throw_5
#+BEGIN_SRC lisp
  ((equal (car exp) 'throw)    (myeval (cadr exp) env block-env catch-env errcont
                                       (lambda (symb-res)
                                         (myeval (caddr exp) env block-env catch-env errcont
                                                 (lambda (exp-res)
                                                   (assoc-2 symb-res catch-env
                                                            (lambda (cont-res)
                                                              (funcall cont-res exp-res))
                                                            (lambda (key)
                                                              (funcall errcont
                                                                       (format nil "throw: matching ~A catch is not found" key)))))))))
#+END_SRC

Тесты для THROW

#+NAME: myeval_throw_5_test
#+BEGIN_SRC lisp
  ;; Тесты для THROW
  (assert (equal 3 (myeval '(catch 'testcatch (throw 'testcatch (+ 1 2)) 777)
                           nil nil nil #'err #'ok)))
  (assert (equal "error" (myeval '(catch 'testcatch (throw 'notcatch (+ 1 2)) 777)
                                 nil nil nil
                                 #'(lambda (x) "error")
                                 #'ok)))
  (assert (equal "error" (myeval '(progn (throw 'not-found-catch (+ 1 2)) 777)
                                 nil nil nil (lambda (x) "error")
                                 #'ok)))
  ;; Тест THROW в лексической области видимости
  (assert (equal 12 (myeval '(progn
                              (defun foo (x)
                                (catch 'in-lambda-catch
                                  (throw 'in-lambda-catch
                                    (+ x 2))
                                  777))
                              (foo 10))
                            nil nil nil (lambda (x) "error")
                            #'ok)))
  ;; Тест THROW в динамической области видимости (должно сработать)
  (assert (equal 12 (myeval '(progn
                              (defun foo (x)
                                (throw 'in-lambda-catch
                                  (+ x 2))
                                777)
                              (catch 'in-lambda-catch
                                (foo 10)))
                            nil nil nil (lambda (x) "error")
                            #'ok)))
#+END_SRC

* REPL

#+NAME: repl_5
#+BEGIN_SRC lisp
  (defun repl ()
    (princ "microlisp>")
    (finish-output)
    (princ (myeval (read) nil #'identity #'identity))
    (terpri)
    (finish-output)
    (repl))
#+END_SRC

