www/lrn/lisp/lisp-5.html

<div id="outline-container-orga9a31b9" class="outline-3">
<h3 id="orga9a31b9">RETURN-FROM</h3>
<div class="outline-text-3" id="text-orga9a31b9">
<p>
При выходе из блока мы извлекаем из окружения <code>block-env</code> соответствующее продолжение и
вызываем его.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org457f628">((equal (car exp)
        'return-from)        (if (not (symbolp (cadr exp)))
                                 (funcall errcont
                                          (format nil
                                                  "return-from: first argument not a symbol"))
                                 (myeval (caddr exp) env block-env catch-env errcont
                                         (lambda (x)
                                           (assoc-2 (cadr exp) block-env
                                                    (lambda (y) (funcall y x))
                                                    (lambda (y) (funcall errcont
                                                                         (format nil "return-from: undefined return block ~A" y))))))))
</pre>
</div>

<p>
Тесты для RETURN-FROM
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org4fc315d">;; Тесты для RETURN-FROM
(assert (equal 3 (myeval '(block testblock (return-from testblock (+ 1 2)) 777)
                         nil nil nil #'err #'ok)))
(assert (equal "error" (myeval '(block testblock (return-from notblock (+ 1 2)) 777)
                               nil nil nil #'(lambda (x) "error") #'ok)))
(assert (equal "error" (myeval '(progn (return-from not-found-block (+ 1 2)) 777)
                               nil nil nil (lambda (x) "error")
                               #'ok)))
;; Тест RETURN-FROM в лексической области видимости
(assert (equal 12 (myeval '(progn
                            (defun foo (x)
                              (block in-lambda-block
                                (return-from in-lambda-block
                                  (+ x 2))
                                777))
                            (foo 10))
                          nil nil nil (lambda (x) "error")
                          #'ok)))
;; Тест RETURN-FROM в динамической области видимости (должна быть ошибка)
(assert (equal "error" (myeval '(progn
                                 (defun foo (x)
                                   (return-from in-lambda-block
                                     (+ x 2))
                                   777)
                                 (block in-lambda-block
                                   (foo 10)))
                               nil nil nil (lambda (x) "error")
                               #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d1c687" class="outline-3">
<h3 id="org9d1c687">CATCH</h3>
<div class="outline-text-3" id="text-org9d1c687">
<p>
При создании блока обработки исключений мы добавляем в окружение <code>catch-env</code> пару вида
"(имя блока . продолжение)".
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org86e5694">((equal (car exp) 'catch)    (myeval (cadr exp) env block-env catch-env errcont
                                     (lambda (symb-res)
                                       (if (not (symbolp symb-res))
                                           (funcall errcont
                                                    (format nil "catch: first argument not a symbol"))
                                           (myeval (caddr exp)
                                                   env
                                                   block-env
                                                   (acons symb-res
                                                          cont
                                                          catch-env)
                                                   errcont cont)))))
</pre>
</div>

<p>
Тесты для CATCH
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org5ec64b7">;; Тесты для CATCH
(assert (equal nil (myeval '(catch 'zzz)
                           nil nil nil #'err #'ok)))
(assert (equal 3 (myeval '(catch 'zzz 3)
                         nil nil nil #'err #'ok)))

</pre>
</div>
</div>
</div>

<div id="outline-container-org37b11ef" class="outline-3">
<h3 id="org37b11ef">THROW</h3>
<div class="outline-text-3" id="text-org37b11ef">
<p>
Когда мы бросаем исключение, мы извлекаем из окружения <code>catch-env</code> соответствующее
продолжение и вызываем его.
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="org3d905d3">((equal (car exp) 'throw)    (myeval (cadr exp) env block-env catch-env errcont
                                     (lambda (symb-res)
                                       (myeval (caddr exp) env block-env catch-env errcont
                                               (lambda (exp-res)
                                                 (assoc-2 symb-res catch-env
                                                          (lambda (cont-res)
                                                            (funcall cont-res exp-res))
                                                          (lambda (key)
                                                            (funcall errcont
                                                                     (format nil "throw: matching ~A catch is not found" key)))))))))
</pre>
</div>

<p>
Тесты для THROW
</p>

<div class="org-src-container">
<pre class="src src-lisp" id="orgcf42fee">;; Тесты для THROW
(assert (equal 3 (myeval '(catch 'testcatch (throw 'testcatch (+ 1 2)) 777)
                         nil nil nil #'err #'ok)))
(assert (equal "error" (myeval '(catch 'testcatch (throw 'notcatch (+ 1 2)) 777)
                               nil nil nil
                               #'(lambda (x) "error")
                               #'ok)))
(assert (equal "error" (myeval '(progn (throw 'not-found-catch (+ 1 2)) 777)
                               nil nil nil (lambda (x) "error")
                               #'ok)))
;; Тест THROW в лексической области видимости
(assert (equal 12 (myeval '(progn
                            (defun foo (x)
                              (catch 'in-lambda-catch
                                (throw 'in-lambda-catch
                                  (+ x 2))
                                777))
                            (foo 10))
                          nil nil nil (lambda (x) "error")
                          #'ok)))
;; Тест THROW в динамической области видимости (должно сработать)
(assert (equal 12 (myeval '(progn
                            (defun foo (x)
                              (throw 'in-lambda-catch
                                (+ x 2))
                              777)
                            (catch 'in-lambda-catch
                              (foo 10)))
                          nil nil nil (lambda (x) "error")
                          #'ok)))
</pre>
</div>
</div>
</div>
</div>
